# **Pandas Tasks:**

# **Tasks on Series:**

In [2]:
# 1. Write a Pandas program to create and display a one-dimensional array-like object containing an array of data using Pandas module.
import pandas as pd
data = [10, 20, 30, 40, 50]
series = pd.Series(data)
print(series)

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [ ]:
# 2. Write a Pandas program to add, subtract, multiple and divide two Pandas Series.
# Sample Series: [2, 4, 6, 8, 10], [1, 3, 5, 7, 9]

s1 = pd.Series([2, 4, 6, 8, 10])
s2 = pd.Series([1, 3, 5, 7, 9])

print("Addition:\n", s1 + s2)
print("Subtraction:\n", s1 - s2)
print("Multiplication:\n", s1 * s2)
print("Division:\n", s1 / s2)

Addition:
 0     3
1     7
2    11
3    15
4    19
dtype: int64
Subtraction:
 0    1
1    1
2    1
3    1
4    1
dtype: int64
Multiplication:
 0     2
1    12
2    30
3    56
4    90
dtype: int64
Division:
 0    2.000000
1    1.333333
2    1.200000
3    1.142857
4    1.111111
dtype: float64

In [ ]:
"""
3. Write a Pandas program to convert a NumPy array to a Pandas series.
Sample Series:
NumPy array:
[10 20 30 40 50]

Converted Pandas series:
0 10
1 20
2 30
3 40
4 50
dtype: int64
"""

import numpy as np
import pandas as pd

arr = np.array([10, 20, 30, 40, 50])
series = pd.Series(arr)

print(series)

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [ ]:
"""
4. Write a Pandas program to change the data type of given a column or a Series.
Sample Series:
Original Data Series:
0 100
1 200
2 python
3 300.12
4 400
dtype: object

Change the said data type to numeric:
0 100.00
1 200.00
2 NaN
3 300.12
4 400.00
dtype: float64
"""

s = pd.Series([100, 200, 'python', 300.12, 400])
print(s)

numeric_s = pd.to_numeric(s, errors='coerce')
print(numeric_s)

0       100
1       200
2    python
3    300.12
4       400
dtype: object
0    100.00
1    200.00
2       NaN
3    300.12
4    400.00
dtype: float64

In [3]:
"""5. Write a Pandas program to convert the first column of a DataFrame as a Series.
Sample Output:
Original DataFrame
col1 col2 col3
0 1 4 7
1 2 5 5
2 3 6 8
3 4 9 12
4 7 5 1
5 11 0 11

1st column as a Series:
0 1
1 2
2 3
3 4
4 7
5 11
"""

df = pd.DataFrame({
    'col1': [1, 2, 3, 4, 7, 11],
    'col2': [4, 5, 6, 9, 5, 0],
    'col3': [7, 5, 8, 12, 1, 11]
})

print("Original DataFrame\n", df)

first_col_series = df.iloc[:, 0]

print("\n1st column as a Series: \n" , first_col_series)

Original DataFrame
    col1  col2  col3
0     1     4     7
1     2     5     5
2     3     6     8
3     4     9    12
4     7     5     1
5    11     0    11

1st column as a Series:
 0     1
1     2
2     3
3     4
4     7
5    11
Name: col1, dtype: int64

# **Tasks on DataFrames:**

In [4]:
"""
1.Write a Pandas program to create a dataframe from a dictionary and display it.
Sample data: {'X':[78,85,96,80,86], 'Y':[84,94,89,83,86],'Z':[86,97,96,72,83]}
Expected Output:
X Y Z
0 78 84 86
1 85 94 97
2 96 89 96
3 80 83 72
4 86 86 83
"""

import pandas as pd
data = {
    'X': [78, 85, 96, 80, 86],
    'Y': [84, 94, 89, 83, 86],
    'Z': [86, 97, 96, 72, 83]
}
df = pd.DataFrame(data)
print(df)

    X   Y   Z
0  78  84  86
1  85  94  97
2  96  89  96
3  80  83  72
4  86  86  83

In [6]:
"""
2. Write a Pandas program to count the number of rows and columns of a DataFrame.
Sample Python dictionary data and list labels:
exam_data = {
'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

Expected Output:
Number of Rows: 10
Number of Columns: 4
"""

import pandas as pd
import numpy as np

exam_data = {
    'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily',
             'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
    'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
    'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
    'qualify': ['yes', 'no', 'yes', 'no', 'no',
                'yes', 'yes', 'no', 'no', 'yes']
}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

df = pd.DataFrame(exam_data, index=labels)

rows = df.shape[0]
cols = df.shape[1]
print("Number of Rows:", rows)
print("Number of Columns:", cols)

Number of Rows: 10
Number of Columns: 4

In [8]:
"""3. Write a Pandas program to select the rows where the score is missing, i.e. is NaN. Go to the editor

Expected Output:
Rows where score is missing:
attempts name qualify score
d 3 James no NaN
h 1 Laura no NaN
"""

missing_scores = df[df['score'].isna()]
print("Rows as score is missing:")
print(missing_scores)

Rows as score is missing:
    name  score  attempts qualify
d  James    NaN         3      no
h  Laura    NaN         1      no

In [9]:
"""
4. Write a Pandas program to calculate the mean of all students' scores. Data is stored in a dataframe. Go to the editor

Expected Output:
Mean score for each different student in data frame: 13.5625
"""

mean_score = df['score'].mean()
print("Mean score: \n", mean_score)

Mean score:
 13.5625

In [10]:
"""
5. Write a Pandas program to sort the DataFrame first by 'name' in descending order, then by 'score' in ascending order.
Sample Python dictionary data and list labels:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
Values for each column will be:
name : "Suresh", score: 15.5, attempts: 1, qualify: "yes", label: "k"
"""


sorted_df = df.sort_values(by=['name', 'score'], ascending=[False, True])
print(sorted_df)

        name  score  attempts qualify
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
c  Katherine   16.5         2     yes
j      Jonas   19.0         1     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
b       Dima    9.0         3      no
a  Anastasia   12.5         1     yes

In [16]:
"""
6. Write a Pandas program to replace the 'qualify' column contains the values 'yes' and 'no' with True and False. Go to the editor
Sample Python dictionary data and list labels:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
Expected Output:
Replace the 'qualify' column contains the values 'yes' and 'no' with T
rue and False:
attempts name qualify score
a 1 Anastasia True 12.5
b 3 Dima False 9.0
......
i 2 Kevin False 8.0
j 1 Jonas True 19.0
"""

df['qualify'] = df['qualify'].map({'yes': True, 'no': False})
print(df)

        name  score  attempts qualify
a  Anastasia   12.5         1     NaN
b       Dima    9.0         3     NaN
c  Katherine   16.5         2     NaN
d      James    NaN         3     NaN
e      Emily    9.0         2     NaN
f    Michael   20.0         3     NaN
g    Matthew   14.5         1     NaN
h      Laura    NaN         1     NaN
i      Kevin    8.0         2     NaN
j      Jonas   19.0         1     NaN

In [17]:
"""
7. Write a Pandas program to change the name 'James' to 'Suresh' in name column of the DataFrame. Go to the editor
Sample Python dictionary data and list labels:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
Expected Output:
Change the name 'James' to \?Suresh\?:
attempts name qualify score
a 1 Anastasia yes 12.5
b 3 Dima no 9.0
.......
i 2 Kevin no 8.0
j 1 Jonas yes 19.0
"""

df['name'] = df['name'].replace('James', 'Suresh')
print(df)

        name  score  attempts qualify
a  Anastasia   12.5         1     NaN
b       Dima    9.0         3     NaN
c  Katherine   16.5         2     NaN
d     Suresh    NaN         3     NaN
e      Emily    9.0         2     NaN
f    Michael   20.0         3     NaN
g    Matthew   14.5         1     NaN
h      Laura    NaN         1     NaN
i      Kevin    8.0         2     NaN
j      Jonas   19.0         1     NaN

In [18]:
"""
8. Write a Pandas program to delete the 'attempts' column from the DataFrame.
Sample Python dictionary data and list labels:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
Expected Output:
Delete the 'attempts' column from the data frame:
name qualify score
a Anastasia yes 12.5
b Dima no 9.0
.....
i Kevin no 8.0
j Jonas yes 19.0
"""

df_no_attempts = df.drop('attempts', axis=1)
print(df_no_attempts)

        name  score qualify
a  Anastasia   12.5     NaN
b       Dima    9.0     NaN
c  Katherine   16.5     NaN
d     Suresh    NaN     NaN
e      Emily    9.0     NaN
f    Michael   20.0     NaN
g    Matthew   14.5     NaN
h      Laura    NaN     NaN
i      Kevin    8.0     NaN
j      Jonas   19.0     NaN

In [20]:
"""9. Write a Pandas program to insert a new column in existing DataFrame. Go to the editor
Sample Python dictionary data and list labels:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
Expected Output:
New DataFrame after inserting the 'color' column
attempts name qualify score color
a 1 Anastasia yes 12.5 Red
b 3 Dima no 9.0 Blue
.......
i 2 Kevin no 8.0 Green
j 1 Jonas yes 19.0 Red
"""

df['color'] = ['Red', 'Blue', 'Green', 'Red', 'Pink',
          'Orange', 'White', 'Black', 'Red', 'Green']
print(df)

        name  score  attempts qualify   color
a  Anastasia   12.5         1     NaN     Red
b       Dima    9.0         3     NaN    Blue
c  Katherine   16.5         2     NaN   Green
d     Suresh    NaN         3     NaN     Red
e      Emily    9.0         2     NaN    Pink
f    Michael   20.0         3     NaN  Orange
g    Matthew   14.5         1     NaN   White
h      Laura    NaN         1     NaN   Black
i      Kevin    8.0         2     NaN     Red
j      Jonas   19.0         1     NaN   Green

In [21]:
"""
10. Write a Pandas program to iterate over rows in a DataFrame. Go to the editor
Sample Python dictionary data and list labels:
exam_data = [{'name':'Anastasia', 'score':12.5}, {'name':'Dima','score':9}, {'name':'Katherine','score':16.5}]
Expected Output:
Anastasia 12.5
Dima 9.0
Katherine 16.5
"""
exam_data = [
    {'name': 'Anastasia', 'score': 12.5},
    {'name': 'Dima', 'score': 9},
    {'name': 'Katherine', 'score': 16.5}
]
df = pd.DataFrame(exam_data)

for index, row in df.iterrows():
    print(row['name'], row['score'])

Anastasia 12.5
Dima 9.0
Katherine 16.5

In [22]:
"""
11. Write a Pandas program to rename columns of a given DataFrame
Sample data:
Original DataFrame
col1 col2 col3
0 1 4 7
1 2 5 8
2 3 6 9
New DataFrame after renaming columns:
Column1 Column2 Column3
0 1 4 7
1 2 5 8
2 3 6 9
Click me to see the sample solution
"""

df = pd.DataFrame({
    'col1': [1, 2, 3],
    'col2': [4, 5, 6],
    'col3': [7, 8, 9]
})

df.columns = ['Column1', 'Column2', 'Column3']
print(df)

   Column1  Column2  Column3
0        1        4        7
1        2        5        8
2        3        6        9

In [23]:
"""
12. Write a Pandas program to select rows from a given DataFrame based on values in some columns.
Sample data:
Original DataFrame
col1 col2 col3
0 1 4 7
1 4 5 8
2 3 6 9
3 4 7 0
4 5 8 1
Rows for colum1 value == 4
col1 col2 col3
1 4 5 8
3 4 7 0
"""

df = pd.DataFrame({
    'col1': [1, 4, 3, 4, 5],
    'col2': [4, 5, 6, 7, 8],
    'col3': [7, 8, 9, 0, 1]
})

print(df[df['col1'] == 4])

   col1  col2  col3
1     4     5     8
3     4     7     0

In [28]:
"""
13. Write a Pandas program to add one row in an existing DataFrame. Go to the editor
Sample data:
Original DataFrame
col1 col2 col3
0 1 4 7
1 4 5 8
2 3 6 9
3 4 7 0
4 5 8 1
After add one row:
col1 col2 col3
0 1 4 7
1 4 5 8
2 3 6 9
3 4 7 0
4 5 8 1
5 10 11 12
"""
new_row = {'col1': 10, 'col2': 11, 'col3': 12}
df.loc[len(df)] = new_row
print(df)

          city  Number of people
0   California               4.0
1      Georgia               2.0
2  Los Angeles               4.0
3          NaN               NaN
4          NaN               NaN

In [25]:
"""
14. Write a Pandas program to count city wise number of people from a given of data set (city, name of the person).
Sample data:
city Number of people
0 California 4
1 Georgia 2
2 Los Angeles 4
"""
data = {'city': ['California', 'Georgia', 'Los Angeles'],
        'Number of people': [4, 2, 4]}

df = pd.DataFrame(data)
print(df)

          city  Number of people
0   California                 4
1      Georgia                 2
2  Los Angeles                 4

In [29]:
"""
15. Write a Pandas program to delete DataFrame row(s) based on given column value. Go to the editor
Sample data:
Original DataFrame
col1 col2 col3
0 1 4 7
1 4 5 8
2 3 6 9
3 4 7 0
4 5 8 1
New DataFrame
col1 col2 col3
0 1 4 7
2 3 6 9
3 4 7 0
4 5 8 1
"""

df = pd.DataFrame({
    'col1': [1, 4, 3, 4, 5],
    'col2': [4, 5, 6, 7, 8],
    'col3': [7, 8, 9, 0, 1]
})

df = df.drop(df[df['col1'] == 5].index)
print(df)

   col1  col2  col3
0     1     4     7
1     4     5     8
2     3     6     9
3     4     7     0

In [30]:
"""
16. Write a Pandas program to select a row of series/dataframe by given integer index.
Sample data:
Original DataFrame
col1 col2 col3
0 1 4 7
1 4 5 8
2 3 6 9
3 4 7 0
4 5 8 1
Index-2: Details
col1 col2 col3
2 3 6 9
"""

print(df.iloc[2])

col1    3
col2    6
col3    9
Name: 2, dtype: int64

In [ ]:
"""
17. Write a Pandas program to replace all the NaN values with Zero's in a column of a dataframe.
Sample data:
Original DataFrame
attempts name qualify score
0 1 Anastasia yes 12.5
1 3 Dima no 9.0
2 2 Katherine yes 16.5
3 3 James no NaN
4 2 Emily no 9.0
5 3 Michael yes 20.0
6 1 Matthew yes 14.5
7 1 Laura no NaN
8 2 Kevin no 8.0
9 1 Jonas yes 19.0
New DataFrame replacing all NaN with 0:
attempts name qualify score
0 1 Anastasia yes 12.5
1 3 Dima no 9.0
2 2 Katherine yes 16.5
3 3 James no 0.0
4 2 Emily no 9.0
5 3 Michael yes 20.0
6 1 Matthew yes 14.5
7 1 Laura no 0.0
8 2 Kevin no 8.0
9 1 Jonas yes 19.0
"""
df['score'] = df['score'].fillna(0)
print(df)

In [34]:
"""
18. Write a Pandas program to set a given value for particular cell in  DataFrame using index value. Go to the editor
Sample data:
Original DataFrame
attempts name qualify score
0 1 Anastasia yes 12.5
1 3 Dima no 9.0
2 2 Katherine yes 16.5
3 3 James no NaN
4 2 Emily no 9.0
5 3 Michael yes 20.0
6 1 Matthew yes 14.5
7 1 Laura no NaN
8 2 Kevin no 8.0
9 1 Jonas yes 19.0
Set a given value for particular cell in the DataFrame
attempts name qualify score
0 1 Anastasia yes 12.5
1 3 Dima no 9.0
2 2 Katherine yes 16.5
3 3 James no NaN
4 2 Emily no 9.0
5 3 Michael yes 20.0
6 1 Matthew yes 14.5
7 1 Laura no NaN
8 2 Kevin no 10.2
9 1 Jonas yes 19.0
"""

exam_data = {
    'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily',
             'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
    'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
    'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
    'qualify': ['yes', 'no', 'yes', 'no', 'no',
                'yes', 'yes', 'no', 'no', 'yes']
}
labels = range(10)
df = pd.DataFrame(exam_data, index=labels)

df.loc[8, 'score'] = 10.2
print(df)

        name  score  attempts qualify
0  Anastasia   12.5         1     yes
1       Dima    9.0         3      no
2  Katherine   16.5         2     yes
3      James    NaN         3      no
4      Emily    9.0         2      no
5    Michael   20.0         3     yes
6    Matthew   14.5         1     yes
7      Laura    NaN         1      no
8      Kevin   10.2         2      no
9      Jonas   19.0         1     yes

In [38]:
"""
19. Write a Pandas program to count the NaN values in one or more columns in DataFrame. Go to the editor
Sample data:
Original DataFrame
attempts name qualify score
0 1 Anastasia yes 12.5
1 3 Dima no 9.0
2 2 Katherine yes 16.5
3 3 James no NaN
4 2 Emily no 9.0
5 3 Michael yes 20.0
6 1 Matthew yes 14.5
7 1 Laura no NaN
8 2 Kevin no 8.0
9 1 Jonas yes 19.0
Number of NaN values in one or more columns:2
"""

print(df.isna().sum())

name        0
score       2
attempts    0
qualify     0
dtype: int64

In [45]:
"""
20. Write a Pandas program to reset index in a given DataFrame. Go to the editor
Sample data:
Original DataFrame
attempts name qualify score
0 1 Anastasia yes 12.5
1 3 Dima no 9.0
2 2 Katherine yes 16.5
3 3 James no NaN
4 2 Emily no 9.0
5 3 Michael yes 20.0
6 1 Matthew yes 14.5
7 1 Laura no NaN
8 2 Kevin no 8.0
9 1 Jonas yes 19.0

After removing first and second rows
attempts name qualify score
2 2 Katherine yes 16.5
3 3 James no NaN
4 2 Emily no 9.0
5 3 Michael yes 20.0
6 1 Matthew yes 14.5
7 1 Laura no NaN
8 2 Kevin no 8.0
9 1 Jonas yes 19.0

Reset the Index:
index attempts name qualify score
0 2 2 Katherine yes 16.5
1 3 3 James no NaN
2 4 2 Emily no 9.0
3 5 3 Michael yes 20.0
4 6 1 Matthew yes 14.5
5 7 1 Laura no NaN
6 8 2 Kevin no 8.0
7 9 1 Jonas yes 19.0
"""
exam_data = {
    'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily',
             'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
    'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
    'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
    'qualify': ['yes', 'no', 'yes', 'no', 'no',
                'yes', 'yes', 'no', 'no', 'yes']
}
labels = range(10)
df = pd.DataFrame(exam_data, index=labels)

df = df.drop([0, 1])
df_reset = df.reset_index()
print(df_reset)

   index       name  score  attempts qualify
0      2  Katherine   16.5         2     yes
1      3      James    NaN         3      no
2      4      Emily    9.0         2      no
3      5    Michael   20.0         3     yes
4      6    Matthew   14.5         1     yes
5      7      Laura    NaN         1      no
6      8      Kevin    8.0         2      no
7      9      Jonas   19.0         1     yes

In [46]:
"""
21. Write a Pandas program to merge two given dataframes with different columns.
Test Data:
data1:
  key1 key2   P   Q
0   K0   K0  P0  Q0
1   K0   K1  P1  Q1
2   K1   K0  P2  Q2
3   K2   K1  P3  Q3
data2:
  key1 key2   R   S
0   K0   K0  R0  S0
1   K1   K0  R1  S1
2   K1   K0  R2  S2
3   K2   K0  R3  S3
"""

import pandas as pd

data1 = {
    'key1': ['K0', 'K0', 'K1', 'K2'],
    'key2': ['K0', 'K1', 'K0', 'K1'],
    'P': ['P0', 'P1', 'P2', 'P3'],
    'Q': ['Q0', 'Q1', 'Q2', 'Q3']
}
df1 = pd.DataFrame(data1)

data2 = {
    'key1': ['K0', 'K1', 'K1', 'K2'],
    'key2': ['K0', 'K0', 'K0', 'K0'],
    'R': ['R0', 'R1', 'R2', 'R3'],
    'S': ['S0', 'S1', 'S2', 'S3']
}
df2 = pd.DataFrame(data2)

merged_df = pd.merge(df1, df2, on=['key1', 'key2'], how='outer')  # Outer to get all rows from the two dataframes
print(merged_df)

  key1 key2    P    Q    R    S
0   K0   K0   P0   Q0   R0   S0
1   K0   K1   P1   Q1  NaN  NaN
2   K1   K0   P2   Q2   R1   S1
3   K1   K0   P2   Q2   R2   S2
4   K2   K0  NaN  NaN   R3   S3
5   K2   K1   P3   Q3  NaN  NaN

In [50]:
"""
22. Write a Pandas program to Combine two DataFrame objects by filling null values in one DataFrame with non-null values from other DataFrame. Go to the editor
Test Data:
Original DataFrames:
     A  B
0  NaN  3
1  0.0  4
2  NaN  5

   A    B
0  1  3.0
1  1  NaN
2  3  3.0
"""

import pandas as pd
import numpy as np

df1 = pd.DataFrame({
    'A': [np.nan, 0.0, np.nan],
    'B': [3, 4, 5]
})

df2 = pd.DataFrame({
    'A': [1, 1, 3],
    'B': [3.0, np.nan, 3.0]
})

# combined_df = df1.combine_first(df2)
combined_df = df1.fillna(df2)
print(combined_df)

     A  B
0  1.0  3
1  0.0  4
2  3.0  5

In [51]:
"""
23. Write a Pandas program to combine the columns of two potentially differently-indexed DataFrames into a single result DataFrame.
Test Data:
data1:
     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

data2:
     C   D
K0  C0  D0
K2  C2  D2
K3  C3  D3
"""

data1 = {
    'A': ['A0', 'A1', 'A2'],
    'B': ['B0', 'B1', 'B2']
}
df1 = pd.DataFrame(data1, index=['K0', 'K1', 'K2'])

data2 = {
    'C': ['C0', 'C2', 'C3'],
    'D': ['D0', 'D2', 'D3']
}
df2 = pd.DataFrame(data2, index=['K0', 'K2', 'K3'])

combined_df = pd.concat([df1, df2], axis=1) #axis=1 to use the index row
print(combined_df)

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

In [52]:
"""
24. Write a Pandas program to join (left join) the two dataframes using keys from left dataframe only. Go to the editor
Test Data:
data1:
  key1 key2   P   Q
0   K0   K0  P0  Q0
1   K0   K1  P1  Q1
2   K1   K0  P2  Q2
3   K2   K1  P3  Q3
data2:
  key1 key2   R   S
0   K0   K0  R0  S0
1   K1   K0  R1  S1
2   K1   K0  R2  S2
3   K2   K0  R3  S3
"""
data1 = {
    'key1': ['K0', 'K0', 'K1', 'K2'],
    'key2': ['K0', 'K1', 'K0', 'K1'],
    'P': ['P0', 'P1', 'P2', 'P3'],
    'Q': ['Q0', 'Q1', 'Q2', 'Q3']
}
df1 = pd.DataFrame(data1)

data2 = {
    'key1': ['K0', 'K1', 'K1', 'K2'],
    'key2': ['K0', 'K0', 'K0', 'K0'],
    'R': ['R0', 'R1', 'R2', 'R3'],
    'S': ['S0', 'S1', 'S2', 'S3']
}
df2 = pd.DataFrame(data2)

merged_df = pd.merge(df1, df2, how='left', on=['key1', 'key2']) #left join, using keys
print(merged_df)

  key1 key2   P   Q    R    S
0   K0   K0  P0  Q0   R0   S0
1   K0   K1  P1  Q1  NaN  NaN
2   K1   K0  P2  Q2   R1   S1
3   K1   K0  P2  Q2   R2   S2
4   K2   K1  P3  Q3  NaN  NaN

In [54]:
"""
25. Write a Pandas program to find and drop the missing values from World alcohol consumption dataset.
Test Data:
   Year       WHO region                Country Beverage Types  Display Value
0  1986  Western Pacific               Viet Nam           Wine           0.00
1  1986         Americas                Uruguay          Other           0.50
2  1985           Africa           Cte d'Ivoire           Wine           1.62
3  1986         Americas               Colombia           Beer           4.27
4  1987         Americas  Saint Kitts and Nevis           Beer           1.98
"""

data = {
    'Year': [1986, 1986, 1985, 1986, 1987],
    'WHO region': ['Western Pacific', 'Americas', 'Africa', 'Americas', 'Americas'],
    'Country': ['Viet Nam', 'Uruguay', "Cte d'Ivoire", 'Colombia', 'Saint Kitts and Nevis'],
    'Beverage Types': ['Wine', 'Other', 'Wine', 'Beer', 'Beer'],
    'Display Value': [0.00, 0.50, 1.62, 4.27, 1.98]
}

df = pd.DataFrame(data)
df_cleaned = df.dropna()
print(df_cleaned)

   Year       WHO region                Country Beverage Types  Display Value
0  1986  Western Pacific               Viet Nam           Wine           0.00
1  1986         Americas                Uruguay          Other           0.50
2  1985           Africa           Cte d'Ivoire           Wine           1.62
3  1986         Americas               Colombia           Beer           4.27
4  1987         Americas  Saint Kitts and Nevis           Beer           1.98

In [57]:
"""
26. Write a Pandas program to select first 2 rows, 2 columns and specific two columns from World alcohol consumption dataset. Go to the editor
Test Data:
   Year       WHO region                Country Beverage Types  Display Value
0  1986  Western Pacific               Viet Nam           Wine           0.00
1  1986         Americas                Uruguay          Other           0.50
2  1985           Africa           Cte d'Ivoire           Wine           1.62
3  1986         Americas               Colombia           Beer           4.27
4  1987         Americas  Saint Kitts and Nevis           Beer           1.98
"""
# First two rows and first two columns
first_2_rows_2_cols = df.iloc[:2, :2]
print("\nFirst 2 rows and first 2 columns:")
print(first_2_rows_2_cols)

# Select specific two columns (for example, 'Country' and 'Display Value')
specific_columns = df[['Country', 'Beverage Types']]
print("\nSpecific columns: \n" , specific_columns)

First 2 rows and first 2 columns:
   Year       WHO region
0  1986  Western Pacific
1  1986         Americas

Specific columns:
                  Country Beverage Types
0               Viet Nam           Wine
1                Uruguay          Other
2           Cte d'Ivoire           Wine
3               Colombia           Beer
4  Saint Kitts and Nevis           Beer

# **Pandas Grouping and Aggregating Tasks:**

In [61]:
"""
Test Data:
   school class            name date_Of_Birth   age  height  weight  address
S1   s001     V  Alberto Franco     15/05/2002   12    173      35  street1
S2   s002     V    Gino Mcneill     17/05/2002   12    192      32  street2
S3   s003    VI     Ryan Parkes     16/02/1999   13    186      33  street3
S4   s001    VI    Eesha Hinton     25/09/1998   13    167      30  street1
S5   s002     V    Gino Mcneill     11/05/2002   14    151      31  street2
S6   s004    VI    David Parkes     15/09/1997   12    159      32  street4
"""

import pandas as pd

data = {
    'school': ['s001', 's002', 's003', 's001', 's002', 's004'],
    'class': ['V', 'V', 'VI', 'VI', 'V', 'VI'],
    'name': ['Alberto Franco', 'Gino Mcneill', 'Ryan Parkes', 'Eesha Hinton', 'Gino Mcneill', 'David Parkes'],
    'date_Of_Birth': ['15/05/2002', '17/05/2002', '16/02/1999', '25/09/1998', '11/05/2002', '15/09/1997'],
    'age': [12, 12, 13, 13, 14, 12],
    'height': [173, 192, 186, 167, 151, 159],
    'weight': [35, 32, 33, 30, 31, 32],
    'address': ['street1', 'street2', 'street3', 'street1', 'street2', 'street4']
}
df = pd.DataFrame(data, index=['S1','S2','S3','S4','S5','S6'])

In [62]:
# 1. Write a Pandas program to split the following dataframe into groups based on school code. Also check the type of GroupBy object.

# Group by school
grouped = df.groupby('school')

# Check type
print(type(grouped))

# Show groups
for name, group in grouped:
    print(f"Group name: {name}")
    print(group, end="\n\n")

<class 'pandas.core.groupby.generic.DataFrameGroupBy'>
Group name: s001
   school class            name date_Of_Birth  age  height  weight  address
S1   s001     V  Alberto Franco    15/05/2002   12     173      35  street1
S4   s001    VI    Eesha Hinton    25/09/1998   13     167      30  street1

Group name: s002
   school class          name date_Of_Birth  age  height  weight  address
S2   s002     V  Gino Mcneill    17/05/2002   12     192      32  street2
S5   s002     V  Gino Mcneill    11/05/2002   14     151      31  street2

Group name: s003
   school class         name date_Of_Birth  age  height  weight  address
S3   s003    VI  Ryan Parkes    16/02/1999   13     186      33  street3

Group name: s004
   school class          name date_Of_Birth  age  height  weight  address
S6   s004    VI  David Parkes    15/09/1997   12     159      32  street4

In [63]:
#2. Write a Pandas program to split the following dataframe by school code and get mean, min, and max value of age for each school.
age = df.groupby('school')['age'].agg(['mean', 'min', 'max'])
print(age)

        mean  min  max
school
s001    12.5   12   13
s002    13.0   12   14
s003    13.0   13   13
s004    12.0   12   12

In [64]:
#3. Write a Pandas program to split the following given dataframe into groups based on school code and class. Go to the editor
grouped = df.groupby(['school', 'class'])
for name, group in grouped:
    print(f"Group name: {name}")
    print(group, end="\n\n")

Group name: ('s001', 'V')
   school class            name date_Of_Birth  age  height  weight  address
S1   s001     V  Alberto Franco    15/05/2002   12     173      35  street1

Group name: ('s001', 'VI')
   school class          name date_Of_Birth  age  height  weight  address
S4   s001    VI  Eesha Hinton    25/09/1998   13     167      30  street1

Group name: ('s002', 'V')
   school class          name date_Of_Birth  age  height  weight  address
S2   s002     V  Gino Mcneill    17/05/2002   12     192      32  street2
S5   s002     V  Gino Mcneill    11/05/2002   14     151      31  street2

Group name: ('s003', 'VI')
   school class         name date_Of_Birth  age  height  weight  address
S3   s003    VI  Ryan Parkes    16/02/1999   13     186      33  street3

Group name: ('s004', 'VI')
   school class          name date_Of_Birth  age  height  weight  address
S6   s004    VI  David Parkes    15/09/1997   12     159      32  street4

In [66]:
#4. Write a Pandas program to split the following given dataframe into groups based on single column and multiple columns. Find the size of the grouped data. Go to the editor


# Group by single column 'school' and get group size
size_by_school = df.groupby('school').size()
print("Group size by school: \n", size_by_school)

# Group by multiple columns 'school' and 'class' and get group size
size_by_school_class = df.groupby(['school', 'class']).size()
print("Group size by school and class: \n" , size_by_school_class)

Group size by school:
 school
s001    2
s002    2
s003    1
s004    1
dtype: int64
Group size by school and class:
 school  class
s001    V        1
        VI       1
s002    V        2
s003    VI       1
s004    VI       1
dtype: int64

In [68]:
"""
Test Data:

    ord_no  purch_amt    ord_date  customer_id  salesman_id
0    70001     150.50  2012-10-05         3005         5002
1    70009     270.65  2012-09-10         3001         5005
2    70002      65.26  2012-10-05         3002         5001
3    70004     110.50  2012-08-17         3009         5003
4    70007     948.50  2012-09-10         3005         5002
5    70005    2400.60  2012-07-27         3007         5001
6    70008    5760.00  2012-09-10         3002         5001
7    70010    1983.43  2012-10-10         3004         5006
8    70003    2480.40  2012-10-10         3009         5003
9    70012     250.45  2012-06-27         3008         5002
10   70011      75.29  2012-08-17         3003         5007
11   70013    3045.60  2012-04-25         3002         5001
"""

data2 = {
    'ord_no': [70001, 70009, 70002, 70004, 70007, 70005, 70008, 70010, 70003, 70012, 70011, 70013],
    'purch_amt': [150.50, 270.65, 65.26, 110.50, 948.50, 2400.60, 5760.00, 1983.43, 2480.40, 250.45, 75.29, 3045.60],
    'ord_date': ['2012-10-05', '2012-09-10', '2012-10-05', '2012-08-17', '2012-09-10', '2012-07-27',
                 '2012-09-10', '2012-10-10', '2012-10-10', '2012-06-27', '2012-08-17', '2012-04-25'],
    'customer_id': [3005, 3001, 3002, 3009, 3005, 3007, 3002, 3004, 3009, 3008, 3003, 3002],
    'salesman_id': [5002, 5005, 5001, 5003, 5002, 5001, 5001, 5006, 5003, 5002, 5007, 5001]
}
df2 = pd.DataFrame(data2)

print(df2)

    ord_no  purch_amt    ord_date  customer_id  salesman_id
0    70001     150.50  2012-10-05         3005         5002
1    70009     270.65  2012-09-10         3001         5005
2    70002      65.26  2012-10-05         3002         5001
3    70004     110.50  2012-08-17         3009         5003
4    70007     948.50  2012-09-10         3005         5002
5    70005    2400.60  2012-07-27         3007         5001
6    70008    5760.00  2012-09-10         3002         5001
7    70010    1983.43  2012-10-10         3004         5006
8    70003    2480.40  2012-10-10         3009         5003
9    70012     250.45  2012-06-27         3008         5002
10   70011      75.29  2012-08-17         3003         5007
11   70013    3045.60  2012-04-25         3002         5001

In [69]:
# 5. Write a Pandas program to split a dataset to group by two columns and count by each row.

grouped_count = df2.groupby(['customer_id', 'salesman_id']).size().reset_index(name='counts') ## Group by two columns and count rows in each group
print(grouped_count)

   customer_id  salesman_id  counts
0         3001         5005       1
1         3002         5001       3
2         3003         5007       1
3         3004         5006       1
4         3005         5002       2
5         3007         5001       1
6         3008         5002       1
7         3009         5003       2

In [72]:
# 6. Write a Pandas program to split a dataset to group by two columns and then sort the aggregated results within the groups.
# In the following dataset group on 'customer_id', 'salesman_id' and then sort sum of purch_amt within the groups.

# Group by customer_id and salesman_id and sum purch_amt
grouped_col = df2.groupby(['customer_id', 'salesman_id'])
grouped_sum = grouped_col['purch_amt'].sum().reset_index()
sorted_group = grouped_sum.sort_values(by=['customer_id', 'purch_amt'], ascending=[True, False])
print(sorted_group)

   customer_id  salesman_id  purch_amt
0         3001         5005     270.65
1         3002         5001    8870.86
2         3003         5007      75.29
3         3004         5006    1983.43
4         3005         5002    1099.00
5         3007         5001    2400.60
6         3008         5002     250.45
7         3009         5003    2590.90

In [85]:
"""
7. Write a Pandas program to split the following dataset using group by on first column and aggregate over multiple lists on second column. Go to the editor
Test Data:
  student_id         marks
0       S001  [88, 89, 90]
1       S001  [78, 81, 60]
2       S002  [84, 83, 91]
3       S002  [84, 88, 91]
4       S003  [90, 89, 92]
5       S003  [88, 59, 90]
Output:
student_id
S001 [83.0, 85.0, 75.0]
S002 [84.0, 85.5, 91.0]
S003 [89.0, 74.0, 91.0]
"""
# grouping by student_id and calculating the mean of each position in a list column

data = {
    'student_id': ['S001', 'S002', 'S003'],
    'marks': [[80, 90, 70], [70, 80, 60], [60, 70, 90]]
}

df = pd.DataFrame(data)

df['mark1'] = df['marks'].apply(lambda x: x[0])
df['mark2'] = df['marks'].apply(lambda x: x[1])
df['mark3'] = df['marks'].apply(lambda x: x[2])

grouped = df.groupby('student_id')[['mark1', 'mark2', 'mark3']].mean().reset_index()
grouped['average marks'] = grouped[['mark1', 'mark2', 'mark3']].values.tolist()
print(grouped[['student_id', 'average marks']])

  student_id       average marks
0       S001  [80.0, 90.0, 70.0]
1       S002  [70.0, 80.0, 60.0]
2       S003  [60.0, 70.0, 90.0]

In [87]:
"""
8. Write a Pandas program to split a dataset, group by one column and get mean, min, and max values by group, also change the column name of the aggregated metric.
Using the following dataset find the mean, min, and max values of purchase amount (purch_amt) group by customer id (customer_id).
"""
data = {
    'customer_id': ['C001', 'C002', 'C001', 'C003', 'C002', 'C001'],
    'purch_amt': [1000, 1500, 1200, 1700, 1600, 1100]
}
df = pd.DataFrame(data)

agg_result = df.groupby('customer_id')['purch_amt'].agg('mean', 'min', 'max').reset_index()
print(agg_result)

  customer_id  purch_amt
0        C001     1100.0
1        C002     1550.0
2        C003     1700.0

In [91]:
"""
9. Write a Pandas program to identify the column(s) of a given DataFrame which have at least one missing value.
Test Data:
     ord_no  purch_amt    ord_date  customer_id  salesman_id
0   70001.0     150.50  2012-10-05         3002       5002.0
1       NaN     270.65  2012-09-10         3001       5003.0
2   70002.0      65.26         NaN         3001       5001.0
3   70004.0     110.50  2012-08-17         3003          NaN
4       NaN     948.50  2012-09-10         3002       5002.0
5   70005.0    2400.60  2012-07-27         3001       5001.0
6       NaN    5760.00  2012-09-10         3001       5001.0
7   70010.0    1983.43  2012-10-10         3004          NaN
8   70003.0    2480.40  2012-10-10         3003       5003.0
9   70012.0     250.45  2012-06-27         3002       5002.0
10      NaN      75.29  2012-08-17         3001       5003.0
11  70013.0    3045.60  2012-04-25         3001          NaN
"""

#df2 defined above

missing_cols = df2.columns[df2.isnull().any()]
print(missing_cols.to_list())

['ord_no', 'ord_date', 'salesman_id']

In [93]:
"""
10. Write a Pandas program to count the number of missing values in each column of a given DataFrame.
Test Data:
     ord_no  purch_amt    ord_date  customer_id  salesman_id
0   70001.0     150.50  2012-10-05         3002       5002.0
1       NaN     270.65  2012-09-10         3001       5003.0
2   70002.0      65.26         NaN         3001       5001.0
3   70004.0     110.50  2012-08-17         3003          NaN
4       NaN     948.50  2012-09-10         3002       5002.0
5   70005.0    2400.60  2012-07-27         3001       5001.0
6       NaN    5760.00  2012-09-10         3001       5001.0
7   70010.0    1983.43  2012-10-10         3004          NaN
8   70003.0    2480.40  2012-10-10         3003       5003.0
9   70012.0     250.45  2012-06-27         3002       5002.0
10      NaN      75.29  2012-08-17         3001       5003.0
11  70013.0    3045.60  2012-04-25         3001          NaN"""

missing_counts = df2.isnull().sum()
print(missing_counts)

ord_no         4
purch_amt      0
ord_date       1
customer_id    0
salesman_id    3
dtype: int64

____

Sarah Ali - Mindset Training AI - Level1